### ⚠️ Terraform Plan: Changes detected

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.gcp.google_project_service.appengine: Refreshing state... [id=main-vcompute/appengine.googleapis.com]
module.gcp.google_project_service.artifactregistry: Refreshing state... [id=main-vcompute/artifactregistry.googleapis.com]
module.gcp.google_service_account.main: Refreshing state... [id=projects/main-vcompute/serviceAccounts/tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_service.run: Refreshing state... [id=main-vcompute/run.googleapis.com]
module.gcp.google_project_service.monitoring: Refreshing state... [id=main-vcompute/monitoring.googleapis.com]
module.gcp.google_project_iam_member.compute_network_user: Refreshing state... [id=main-vcompute/roles/compute.networkUser/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_service_account.terraform: Refreshing state... [id=projects/main-vcompute/serviceAccounts/tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_service.sqladmin: Refreshing state... [id=main-vcompute/sqladmin.googleapis.com]
module.gcp.google_project_service.compute: Refreshing state... [id=main-vcompute/compute.googleapis.com]
module.gcp.google_project_service.cloudbuild: Refreshing state... [id=main-vcompute/cloudbuild.googleapis.com]
module.gcp.google_project_service.logging: Refreshing state... [id=main-vcompute/logging.googleapis.com]
module.gcp.google_project_service.iamcredentials: Refreshing state... [id=main-vcompute/iamcredentials.googleapis.com]
module.gcp.google_project_service.storage: Refreshing state... [id=main-vcompute/storage.googleapis.com]
module.gcp.google_project_service.servicenetworking: Refreshing state... [id=main-vcompute/servicenetworking.googleapis.com]
module.gcp.google_project_service.iam: Refreshing state... [id=main-vcompute/iam.googleapis.com]
module.gcp.google_project_service.cloudresourcemanager: Refreshing state... [id=main-vcompute/cloudresourcemanager.googleapis.com]
module.gcp.google_project_iam_member.terraform_network_admin: Refreshing state... [id=main-vcompute/roles/compute.networkAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_sa_admin: Refreshing state... [id=main-vcompute/roles/iam.serviceAccountAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_cloudbuild_builder: Refreshing state... [id=main-vcompute/roles/cloudbuild.builds.editor/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_artifact_admin: Refreshing state... [id=main-vcompute/roles/artifactregistry.admin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_run_admin: Refreshing state... [id=main-vcompute/roles/run.admin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_wip_admin: Refreshing state... [id=main-vcompute/roles/iam.workloadIdentityPoolAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_service_usage: Refreshing state... [id=main-vcompute/roles/serviceusage.serviceUsageAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_sa_user: Refreshing state... [id=main-vcompute/roles/iam.serviceAccountUser/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_appengine_deployer: Refreshing state... [id=main-vcompute/roles/appengine.deployer/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_iam_admin: Refreshing state... [id=main-vcompute/roles/resourcemanager.projectIamAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_appengine_admin: Refreshing state... [id=main-vcompute/roles/appengine.appAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_sql_admin: Refreshing state... [id=main-vcompute/roles/cloudsql.admin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_storage_admin: Refreshing state... [id=main-vcompute/roles/storage.admin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.sql_client: Refreshing state... [id=main-vcompute/roles/cloudsql.client/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.sql_instance_user: Refreshing state... [id=main-vcompute/roles/cloudsql.instanceUser/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.artifact_reader: Refreshing state... [id=main-vcompute/roles/artifactregistry.reader/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.monitoring_writer: Refreshing state... [id=main-vcompute/roles/monitoring.metricWriter/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.logging_writer: Refreshing state... [id=main-vcompute/roles/logging.logWriter/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.storage_viewer: Refreshing state... [id=main-vcompute/roles/storage.objectViewer/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_app_engine_application.main: Refreshing state... [id=main-vcompute]
module.gcp.google_compute_network.main: Refreshing state... [id=projects/main-vcompute/global/networks/tut-bus-network]
module.gcp.google_artifact_registry_repository.main: Refreshing state... [id=projects/main-vcompute/locations/asia-northeast1/repositories/tut-bus]
module.gcp.google_app_engine_domain_mapping.main: Refreshing state... [id=apps/main-vcompute/domainMappings/tut-bus-api.hekuta.net]
module.gcp.google_compute_subnetwork.main: Refreshing state... [id=projects/main-vcompute/regions/asia-northeast1/subnetworks/tut-bus-subnet]
module.gcp.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/main-vcompute/global/addresses/tut-bus-private-ip-address]
module.gcp.google_iam_workload_identity_pool.github: Refreshing state... [id=projects/main-vcompute/locations/global/workloadIdentityPools/tut-bus-github-pool]
module.gcp.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fmain-vcompute%2Fglobal%2Fnetworks%2Ftut-bus-network:servicenetworking.googleapis.com]
module.gcp.google_service_account_iam_member.workload_identity_user: Refreshing state... [id=projects/main-vcompute/serviceAccounts/tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/897661050223/locations/global/workloadIdentityPools/tut-bus-github-pool/attribute.repository/lc-tut/tut-bus]
module.gcp.google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/main-vcompute/locations/global/workloadIdentityPools/tut-bus-github-pool/providers/tut-bus-github-provider]
module.gcp.google_sql_database_instance.main: Refreshing state... [id=tut-bus-db-prod]
module.gcp.google_sql_database.main: Refreshing state... [id=projects/main-vcompute/instances/tut-bus-db-prod/databases/tutbus]
module.gcp.google_sql_user.iam_user: Refreshing state... [id=tut-bus-app-sa@main-vcompute.iam//tut-bus-db-prod]
module.cloudflare.cloudflare_zone_setting.tls_1_3: Refreshing state... [id=tls_1_3]
module.cloudflare.cloudflare_zone_setting.ssl: Refreshing state... [id=ssl]
module.cloudflare.cloudflare_dns_record.api: Refreshing state... [id=a3e71d7988b7432d3785af839b2a4a2e]
module.cloudflare.cloudflare_zone_setting.always_use_https: Refreshing state... [id=always_use_https]
module.cloudflare.cloudflare_zone_setting.min_tls_version: Refreshing state... [id=min_tls_version]
module.cloudflare.cloudflare_zone_setting.http3: Refreshing state... [id=http3]
module.vercel.vercel_project.main: Refreshing state... [id=prj_ta1sUOqYijyfarPliK1sCzMgPGuU]
module.vercel.vercel_project_environment_variable.auth_github_secret: Refreshing state... [id=E6uUsxp6KJi9SRUk]
module.vercel.vercel_project_environment_variable.better_auth_secret: Refreshing state... [id=6VVNlUlKRnezdZ7C]
module.vercel.vercel_project_environment_variable.api_url_preview: Refreshing state... [id=Gcpv4ICO9QRt7qT2]
module.vercel.vercel_project_environment_variable.enable_corepack: Refreshing state... [id=2ayLvYXUkEv4jjWR]
module.vercel.vercel_project_environment_variable.app_url_production: Refreshing state... [id=zRYolmZAgsQ7YNja]
module.vercel.vercel_project_environment_variable.announcement_type[0]: Refreshing state... [id=W56FUcAPsLBuHT9m]
module.vercel.vercel_project_environment_variable.announcement_link_url[0]: Refreshing state... [id=HQlItLGH01djcN4K]
module.vercel.vercel_project_environment_variable.api_url_development: Refreshing state... [id=EXdxqGlu1U6l1HVY]
module.vercel.vercel_project_domain.redirect_domains["tut-bus.hekuta.net"]: Refreshing state... [id=tut-bus.hekuta.net]
module.vercel.vercel_project_environment_variable.announcement_title[0]: Refreshing state... [id=9x2XVPxcVQYEbNwL]
module.vercel.vercel_project_deployment_retention.main[0]: Refreshing state... [id=team_kIKSNppKX4A6hEGHw7pLgbPV/prj_ta1sUOqYijyfarPliK1sCzMgPGuU]
module.vercel.vercel_project_environment_variable.api_url_production: Refreshing state... [id=XDIdV4P6lHRBdGiJ]
module.vercel.vercel_project_environment_variable.auth_allowed_team[0]: Refreshing state... [id=4aL3KkF7eLhrpUs5]
module.vercel.vercel_project_environment_variable.ga_id[0]: Refreshing state... [id=5IX17COFeIWDswkN]
module.vercel.vercel_project_environment_variable.announcement_message[0]: Refreshing state... [id=jWcmmfrIQwZ2ilLs]
module.vercel.vercel_project_domain.vercel_app_redirect[0]: Refreshing state... [id=tut-bus-web.vercel.app]
module.vercel.vercel_project_domain.custom_domain[0]: Refreshing state... [id=tut-bus.lcn.ad.jp]
module.vercel.vercel_project_environment_variable.auth_github_id: Refreshing state... [id=FheTOSCfUktxaZMS]
module.vercel.vercel_project_environment_variable.announcement_link_text[0]: Refreshing state... [id=hPKzWMkE2x4uU21y]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudflare.data.cloudflare_zone.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zone" "main" {
      + account               = (known after apply)
      + activated_on          = (known after apply)
      + cname_suffix          = (known after apply)
      + created_on            = (known after apply)
      + development_mode      = (known after apply)
      + filter                = {
          + match = (known after apply)
          + name  = "hekuta.net"
        }
      + id                    = (known after apply)
      + meta                  = (known after apply)
      + modified_on           = (known after apply)
      + name                  = (known after apply)
      + name_servers          = (known after apply)
      + original_dnshost      = (known after apply)
      + original_name_servers = (known after apply)
      + original_registrar    = (known after apply)
      + owner                 = (known after apply)
      + paused                = (known after apply)
      + permissions           = (known after apply)
      + plan                  = (known after apply)
      + status                = (known after apply)
      + tenant                = (known after apply)
      + tenant_unit           = (known after apply)
      + type                  = (known after apply)
      + vanity_name_servers   = (known after apply)
      + verification_key      = (known after apply)
      + zone_id               = (known after apply)
    }

  # module.cloudflare.cloudflare_dns_record.api must be replaced
-/+ resource "cloudflare_dns_record" "api" {
      ~ comment_modified_on = "2026-02-07T11:13:23Z" -> (known after apply)
      ~ created_on          = "2026-02-07T11:13:23Z" -> (known after apply)
      ~ id                  = "a3e71d7988b7432d3785af839b2a4a2e" -> (known after apply)
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2026-02-07T11:13:23Z" -> (known after apply)
      ~ name                = "tut-bus-api.hekuta.net" -> "tut-bus-api"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
      ~ zone_id             = "2eb08d674eadc0c497d982871450e73e" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.cloudflare.cloudflare_zone_setting.always_use_https must be replaced
-/+ resource "cloudflare_zone_setting" "always_use_https" {
      ~ editable       = true -> (known after apply)
      + enabled        = (known after apply)
      ~ id             = "always_use_https" -> (known after apply)
      ~ modified_on    = "2026-01-06T05:09:26Z" -> (known after apply)
      + time_remaining = (known after apply)
      ~ zone_id        = "2eb08d674eadc0c497d982871450e73e" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cloudflare.cloudflare_zone_setting.http3 must be replaced
-/+ resource "cloudflare_zone_setting" "http3" {
      ~ editable       = true -> (known after apply)
      + enabled        = (known after apply)
      ~ id             = "http3" -> (known after apply)
      + modified_on    = (known after apply)
      + time_remaining = (known after apply)
      ~ zone_id        = "2eb08d674eadc0c497d982871450e73e" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cloudflare.cloudflare_zone_setting.min_tls_version must be replaced
-/+ resource "cloudflare_zone_setting" "min_tls_version" {
      ~ editable       = true -> (known after apply)
      + enabled        = (known after apply)
      ~ id             = "min_tls_version" -> (known after apply)
      + modified_on    = (known after apply)
      + time_remaining = (known after apply)
      ~ zone_id        = "2eb08d674eadc0c497d982871450e73e" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cloudflare.cloudflare_zone_setting.ssl must be replaced
-/+ resource "cloudflare_zone_setting" "ssl" {
      ~ editable       = true -> (known after apply)
      + enabled        = (known after apply)
      ~ id             = "ssl" -> (known after apply)
      ~ modified_on    = "2022-08-08T07:36:54Z" -> (known after apply)
      + time_remaining = (known after apply)
      ~ zone_id        = "2eb08d674eadc0c497d982871450e73e" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cloudflare.cloudflare_zone_setting.tls_1_3 must be replaced
-/+ resource "cloudflare_zone_setting" "tls_1_3" {
      ~ editable       = true -> (known after apply)
      + enabled        = (known after apply)
      ~ id             = "tls_1_3" -> (known after apply)
      + modified_on    = (known after apply)
      + time_remaining = (known after apply)
      ~ zone_id        = "2eb08d674eadc0c497d982871450e73e" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.gcp.google_compute_subnetwork_iam_member.cloud_run_network_user will be created
  + resource "google_compute_subnetwork_iam_member" "cloud_run_network_user" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + project    = "main-vcompute"
      + region     = "asia-northeast1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "tut-bus-subnet"
    }

  # module.gcp.google_project_iam_member.compute_network_user will be destroyed
  # (because google_project_iam_member.compute_network_user is not in configuration)
  - resource "google_project_iam_member" "compute_network_user" {
      - etag    = "BwZKOf4iS9o=" -> null
      - id      = "main-vcompute/roles/compute.networkUser/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com" -> null
      - project = "main-vcompute" -> null
      - role    = "roles/compute.networkUser" -> null
    }

  # module.gcp.google_sql_database_instance.main will be updated in-place
  ~ resource "google_sql_database_instance" "main" {
        id                             = "tut-bus-db-prod"
        name                           = "tut-bus-db-prod"
        # (22 unchanged attributes hidden)

      ~ settings {
            # (19 unchanged attributes hidden)

          + database_flags {
              + name  = "cloudsql.iam_authentication"
              + value = "on"
            }

            # (6 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 1 to change, 7 to destroy.

Changes to Outputs:
  ~ cloudflare_api_record_id                  = "a3e71d7988b7432d3785af839b2a4a2e" -> (known after apply)
  ~ cloudflare_zone_id                        = "2eb08d674eadc0c497d982871450e73e" -> (known after apply)
  ~ cloudflare_zone_name                      = "hekuta.net" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @HEKUCHAN, Branch: `dev`*